Catalogs/УлицыГородов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>УлицыГородов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеУлицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УлицыГородов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СформироватьПредставление()
	Объект.НаименованиеПолное = "";
	Если Объект.ИндексГорода <> "" Тогда
		Объект.НаименованиеПолное = Объект.ИндексГорода + ", ";
	КонецЕсли;
	Если Объект.Область <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + Объект.Область;
	КонецЕсли;
	Если Объект.Район <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.Район;
	КонецЕсли;
	Если Объект.Город <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.Город;
	КонецЕсли;
	Если Объект.НаселенныйПункт <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.НаселенныйПункт;
	КонецЕсли;
	Если Объект.НазваниеУлицы <> "" Тогда
		Объект.НаименованиеПолное = Объект.НаименованиеПолное + ", " + Объект.НазваниеУлицы;
	КонецЕсли;
	Объект.Наименование = Объект.НаименованиеПолное;
КонецПроцедуры

&НаКлиенте
Процедура ОбластьПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура НазваниеУлицыПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

&НаКлиенте
Процедура ИндексПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры
